class_name tpjson


var up_1=0.5
var up_2=3
var up_3=2

var up_other=5

func get_json(data):
	#1为基础属性，2为物品，3为材料
	var tpjs={
		"锻体":[["修为",1,"修为","等于",1000],
		],
	"练气":[
		["修为",1,"修为","等于",Fun.xwzh("锻体","大圆满")]
		],
	"筑基":[
		["修为",1,"修为","等于",Fun.xwzh("练气","大圆满")],
		["筑基丹",2,"二品","初香",1],
		],
	"结丹":[
		["修为",1,"修为","等于",Fun.xwzh("筑基","大圆满")],
		["结金丹",2,"三品","初香",1],
		],
	"元婴":[
		["修为",1,"修为","等于",Fun.xwzh("结丹","大圆满")],
		["九转破婴丹",2,"五品","初香",1],
		],
	"化神":[
		["修为",1,"修为","等于",Fun.xwzh("元婴","大圆满")],
		["凡灵真气",3,"六阶",1],
		],
	"炼虚":[
		["修为",1,"修为","等于",Fun.xwzh("炼虚","大圆满")],
		["合神破虚空石",3,"七阶",1],
		],
	"合体":[
		["修为",1,"修为","等于",Fun.xwzh("合体","大圆满")],
		["乾坤子母果",3,"八阶",1],
		],
	"大乘":[
		["修为",1,"修为","等于",Fun.xwzh("大乘","大圆满")],
		["上界之气",3,"十阶",1],
		],
	"锻体突破":{
		"气血":[up_1*up_2*up_3*100],
		"物理攻击":[up_1*up_2*up_3],
		"速度":[up_1*up_2*up_3],
		"灵气":[up_1*up_2*up_3],
		},
	"锻体破境":{
		"气血":[up_1*up_2*up_3*100+10],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"练气突破":{
		"气血":[up_1*up_2*up_3*100],
		"物理攻击":[up_1*up_2*up_3+1],
		"速度":[up_1*up_2*up_3+1],
		"灵气":[up_1*up_2*up_3+1],
		},
	"练气破境":{
		"气血":[up_1*up_2*up_3*100+100],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"筑基突破":{
		"气血":[up_1*up_2*up_3*100+10],
		"物理攻击":[up_1*up_2*up_3+3],
		"速度":[up_1*up_2*up_3+1],
		"灵气":[up_1*up_2*up_3+2],
		},
	"筑基破境":{
		"气血":[up_1*up_2*up_3*100+200],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"结丹突破":{
		"气血":[up_1*up_2*up_3*100+50],
		"物理攻击":[up_1*up_2*up_3+4],
		"速度":[up_1*up_2*up_3+2],
		"灵气":[up_1*up_2*up_3+4],
		},
	"结丹破境":{
		"气血":[up_1*up_2*up_3*100+200],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"元婴突破":{
		"气血":[up_1*up_2*up_3*100+250],
		"物理攻击":[up_1*up_2*up_3+7],
		"速度":[up_1*up_2*up_3+3],
		"灵气":[up_1*up_2*up_3+5],
		},
	"元婴破境":{
		"气血":[up_1*up_2*up_3*100+400],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"化神突破":{
		"气血":[up_1*up_2*up_3*100+350],
		"物理攻击":[up_1*up_2*up_3+10],
		"速度":[up_1*up_2*up_3+5],
		"灵气":[up_1*up_2*up_3+8],
		},
	"化神破境":{
		"气血":[up_1*up_2*up_3*100+500],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"炼虚突破":{
		"气血":[up_1*up_2*up_3*100+450],
		"物理攻击":[up_1*up_2*up_3+15],
		"速度":[up_1*up_2*up_3+5],
		"灵气":[up_1*up_2*up_3+6],
		},
	"炼虚破境":{
		"气血":[up_1*up_2*up_3*100+600],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"合体突破":{
		"气血":[up_1*up_2*up_3*100+450],
		"物理攻击":[up_1*up_2*up_3+20],
		"速度":[up_1*up_2*up_3+10],
		"灵气":[up_1*up_2*up_3+25],
		},
	"合体破境":{
		"气血":[up_1*up_2*up_3*100+600],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	"大乘突破":{
		"气血":[up_1*up_2*up_3*100+450],
		"物理攻击":[up_1*up_2*up_3+30],
		"速度":[up_1*up_2*up_3+10],
		"灵气":[up_1*up_2*up_3+100],
		},
	"大乘破境":{
		"气血":[up_1*up_2*up_3*100+600],
		"物理攻击":[up_other*up_1+up_2*(data["物理攻击"]*0.7)],
		"速度":[up_other*up_1+up_2*(data["速度"]*0.5)],
		"灵气":[up_other*up_1+up_2*(data["灵气"]*0.4)],
		},
	
	
	}
	return tpjs

